# Pandas intro

In [1]:
import pandas as pd

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\abhis\anaconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\abhis\appdata\roaming\python\python313\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\abhis\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\abhis\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\abhis\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\abhis\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.3 -> 26.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
info = {
    "Name":["Shivam","Nagu","shivu"],
    "CGPA":[9.17,9.25,8.5]
}
df = pd.DataFrame(info)
print(df,type(df))
print(df.index)
print(df.columns)

     Name  CGPA
0  Shivam  9.17
1    Nagu  9.25
2   shivu  8.50 <class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'CGPA'], dtype='object')

In [6]:
s=  pd.Series([1,2,3,4,5])
print(s)
print(s.dtype)
print(type(s))

#indexing
print(s[2])

0    1
1    2
2    3
3    4
4    5
dtype: int64
int64
<class 'pandas.core.series.Series'>
3

In [11]:
s= pd.Series([23,24,25,26],index = ["shiv","Nagu","nishu","Raj"])
print(s)

#labeled access
print(s["shiv"])
print(s["Nagu"])
#index
print(s[1])
print(s.index)

shiv     23
Nagu     24
nishu    25
Raj      26
dtype: int64
23
24
24
Index(['shiv', 'Nagu', 'nishu', 'Raj'], dtype='object')

C:\Users\abhis\AppData\Local\Temp\ipykernel_22352\1361749068.py:8: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[1])

In [13]:
s=  pd.Series([23,24,25,"abc"],index = ["shivu","Nagu","Raj",25])
print(s,s.dtype,s.index)
print(s[25])

shivu     23
Nagu      24
Raj       25
25       abc
dtype: object object Index(['shivu', 'Nagu', 'Raj', 25], dtype='object')
abc

In [14]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
print(s1+s2)

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [15]:
#csv data
df = pd.read_csv("employee_data.csv")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [26]:
df.head() #gives first 5 rows
df.head(3) #gives first 3 rows

df.tail() #gives last 5 rows
df.tail(3) #gives last 3 rows

df.sample()  #one random row content
df.sample(3)  #three random row content

 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [16]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [28]:
df.shape

(10, 5)

In [29]:
df.describe()

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

# usage with csv and json of pandas

In [11]:
# small example
import numpy as np

np_arr = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(np_arr,columns = ["A","B","C"])
print(df)

   A  B  C
0  1  2  3
1  4  5  6

In [40]:
# Read the CS data
df = pd.read_csv("employee_data.csv")
print(df)

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [12]:
df = pd.read_json("employee_data.json")
print(df)

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000

In [13]:
#fromkaggle
df = pd.read_csv("globalAirQuality.csv")
df.head()
df.tail()
df.describe()

,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
count,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000
mean,23.065980,37.655560,40.369131,70.152228,32.055176,6.035508,48.065100,0.800595,104.645556,21.510251,57.714351,5.283910
std,26.156536,78.600701,17.647450,24.999440,13.820680,2.454790,14.950849,0.250254,25.616070,9.509444,18.844908,2.741712
min,-37.814000,-123.121000,0.025000,0.061000,0.013000,0.003000,0.114000,0.000000,16.000000,5.000000,25.002000,0.500000
25%,12.972000,2.352000,27.904500,53.125500,22.362500,4.360750,38.028500,0.633000,87.000000,13.357750,41.320000,2.937000
50%,29.232000,42.146000,40.286500,69.961000,32.019500,6.026000,48.142000,0.800500,103.000000,21.455500,57.847000,5.297000
75%,41.008000,103.820000,52.436250,87.256500,41.364250,7.715250,58.258500,0.969000,121.000000,29.688250,74.234750,7.662000
max,60.170000,174.763000,115.683000,161.810000,90.019000,16.559000,103.016000,1.832000,231.000000,37.998000,89.997000,9.999000

In [14]:
#Selecting data column wise
df["country"]

df[["city","aqi"]]

#Selecting row
df.loc[2]  #select 2nd rows data correspnd to each column

df.loc[0:3]   # in df.loc[st:end]  end is inclusive 

#index access
df.iloc[2]
df.iloc[0:2]   #in df.iloc[st:end]  end is non-inclusive

#select row and column
df.loc[0,["city","aqi"]]

df.loc[7:10,["city","aqi"]]

#accessing through the iloc uses numercal integer so have to find the indices for those
df.columns

df.iloc[7:11,[2,11]]  # 2->idx of city column and 11->idx of aqi columns


#cell level single box
df.at[0,"city"]   # using labled index
df.iat[0,2]  #using numerical index
df.columns

# df.at[0,"city"] = "Delhi"
# df.head()
cities = df["city"]
cities[0]= "Delhi"
print(cities)

0           Delhi
1        New York
2        New York
3        New York
4        New York
           ...
17995      Zurich
17996      Zurich
17997      Zurich
17998      Zurich
17999      Zurich
Name: city, Length: 18000, dtype: object

C:\Users\abhis\AppData\Local\Temp\ipykernel_26012\870152516.py:34: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cities[0]= "Delhi"

# Filtering data

In [16]:
# Filtering data based on different conditions


df[df["aqi"]>100]

df[(df["aqi"]>100) & (df["temperature"]>30)]

#Chaining
aqi_data = df[(df["aqi"]>100)&(df["temperature"]>30)][["city","aqi"]]
aqi_data

aqi_data.iloc[0]
#aqi_data.loc[0]  # doesnt gives anything as label starts from 6
aqi_data.loc[6]

city    New York
aqi          155
Name: 6, dtype: object

In [ ]:
#Select on based of query -  by defalut return copy not view
df.query("aqi>150")
df.query("aqi>100 & temperature>30")[["city","aqi"]]

aqi_val = int(input("enter threshold for aqi: "))
temp_val=int(input("enter threshold for temperature: "))
aqi_data = df.query("aqi>@aqi_val & temperature>@temp_val")[["city","aqi"]].copy()
print(aqi_data)

# cleaning data

In [77]:
df = pd.read_csv("raw_data.csv")

In [120]:
df.isnull()

df.isna()
df.isnull().sum()
#df.dropna(axis = 0)

#replace all missing agee valus with its averae
cleaned_data = df.copy()
avg_mean = df["age"].mean()
cleaned_data["age"] = cleaned_data["age"].fillna(avg_mean)
cleaned_data = cleaned_data.drop_duplicates()

df.ffill()
df.bfill()
cleaned_data

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [121]:
cleaned_data

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [86]:
#Handl Duplicate values

df.duplicated()
df2 = df.copy()

df[["country","gender"]].duplicated()
df.drop_duplicates()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [80]:
# handling Data Types
df.dtypes

id           int64
name        object
age        float64
country     object
gender      object
income     float64
dtype: object

In [118]:
df2 = df.copy()
df2 = df2.fillna(0)
df2["age"] = df2["age"].astype("int64").copy()
df2 = df2.drop_duplicates()
df2.dtypes

id           int64
name        object
age          int64
country     object
gender      object
income     float64
dtype: object

In [94]:
df2

    id          name  age country   gender   income
0    1      John Doe   29     USA     Male  55000.0
2    2    Jane Smith    0  Canada   Female  62000.0
3    3          Alex    0     USA  Unknown  47000.0
4    4  Maria Garcia   34   Spain   Female      0.0
5    5        Li Wei   27   China     Male  51000.0
6    6             0   45   India   Female  73000.0
7    7    Ahmed Khan   38       0     Male  68000.0
8    8    Rachel Lee   29     USA   Female  62000.0
9    9   Carlos Ruiz    0  Mexico     Male  45000.0
10  10   Emily Davis   31     USA        0  58000.0

In [104]:
#Examples
date_str = "2026-12-31"
type(date_str)
date_str = pd.Series(["2026-12-31"])
type(date_str.dtypes)

date_str =pd.Series([pd.to_datetime("2026-12-31")])
type(date_str.dtypes)



aqi_data = pd.read_csv("globalAirQuality.csv")
aqi_data["timestamp"] = pd.to_datetime(aqi_data["timestamp"])
aqi_data["timestamp"].dtypes

dtype('<M8[ns]')

In [115]:
df["gender"].str.lower()
df["gender"].str.capitalize()

df["name"].str.split(" ")

df["country"].str.contains("US",case=False)
# gmail = pd.Series(["shiv@gmail.com"])
# gmail.str.split("@")


# aman@gmail.com
# shradha@gmail.com

0      True
1      True
2     False
3      True
4     False
5     False
6     False
7       NaN
8      True
9     False
10     True
Name: country, dtype: object